// Q13


const map = new Map();

map.set('민수','전화번호: 010-1234-5678, 주소:서울특별시 강남구');
map.set('지영','전화번호: 010-8756-4321, 주소:부산광역시 해운대구');
map.set('현우', '전화번호:010-2345-6789, 주소:대구광역시 수성구');
map.set('수빈', '전화번호:010-8976-4535, 주소:인천광역시 남동구');
map.set('동민','전화번호: 010-3456-7890, 주소:광주광역시 서구');
map.set('하은', '전화번호: 010-6543-2109, 주소: 대전광역시 유성구');

// console.log(map);
if(map.has('동민')){
  map.set('동민','전화번호:010-9999-9999, 주소:광주광역시 서구');
}
console.log(map);

if(map.has('지영')){
  map.delete('지영');
}
console.log(map);

console.log('현재 연락처 개수: '+map.size);